wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_cmp.h
/*!
    \file    gd32g5x3_cmp.h
    \brief   definitions for the CMP

    \version 2026-02-04, V1.5.0, firmware for GD32G5x3
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef GD32G5X3_CMP_H
#define GD32G5X3_CMP_H

#include "gd32g5x3.h"

/* CMP definitions */
#define CMP                                      CMP_BASE                                           /*!< CMP base address */
                                                                                                   
/* registers definitions */                                                                        
#define CMP_STAT                                 REG32((CMP) + 0x00000000U)                         /*!< CMP status */
#define CMP_IFC                                  REG32((CMP) + 0x00000004U)                         /*!< CMP interrupt flag clear */
#define CMP_CS(CMPx)                             REG32((CMP) + 0x00000008U + (CMPx) * 0x00000004U)  /*!< CMPx control and status register */

/* bits definitions */
/* CMP_STAT */
#define CMP_STAT_CMP0O                           BIT(0)                         /*!< CMP0 output state */
#define CMP_STAT_CMP1O                           BIT(1)                         /*!< CMP1 output state */
#define CMP_STAT_CMP2O                           BIT(2)                         /*!< CMP2 output state */
#define CMP_STAT_CMP3O                           BIT(3)                         /*!< CMP3 output state */
#define CMP_STAT_CMP4O                           BIT(4)                         /*!< CMP4 output state */
#define CMP_STAT_CMP5O                           BIT(5)                         /*!< CMP5 output state */
#define CMP_STAT_CMP6O                           BIT(6)                         /*!< CMP6 output state */
#define CMP_STAT_CMP7O                           BIT(7)                         /*!< CMP7 output state */
#define CMP_STAT_CMP0IF                          BIT(16)                        /*!< CMP0 interrupt flag */
#define CMP_STAT_CMP1IF                          BIT(17)                        /*!< CMP1 interrupt flag */
#define CMP_STAT_CMP2IF                          BIT(18)                        /*!< CMP2 interrupt flag */
#define CMP_STAT_CMP3IF                          BIT(19)                        /*!< CMP3 interrupt flag */
#define CMP_STAT_CMP4IF                          BIT(20)                        /*!< CMP4 interrupt flag */
#define CMP_STAT_CMP5IF                          BIT(21)                        /*!< CMP5 interrupt flag */
#define CMP_STAT_CMP6IF                          BIT(22)                        /*!< CMP6 interrupt flag */
#define CMP_STAT_CMP7IF                          BIT(23)                        /*!< CMP7 interrupt flag */

/* CMP_IFC */
#define CMP_IFC_CMP0IC                           BIT(16)                        /*!< CMP0 interrupt flag clear */
#define CMP_IFC_CMP1IC                           BIT(17)                        /*!< CMP1 interrupt flag clear */
#define CMP_IFC_CMP2IC                           BIT(18)                        /*!< CMP2 interrupt flag clear */
#define CMP_IFC_CMP3IC                           BIT(19)                        /*!< CMP3 interrupt flag clear */
#define CMP_IFC_CMP4IC                           BIT(20)                        /*!< CMP4 interrupt flag clear */
#define CMP_IFC_CMP5IC                           BIT(21)                        /*!< CMP5 interrupt flag clear */
#define CMP_IFC_CMP6IC                           BIT(22)                        /*!< CMP6 interrupt flag clear */
#define CMP_IFC_CMP7IC                           BIT(23)                        /*!< CMP7 interrupt flag clear */

/* CMP_CSx */
#define CMP_CS_CMPXEN                            BIT(0)                         /*!< CMPx enable */
#define CMP_CS_CMPXBEN                           BIT(1)                         /*!< CMPx bridge enable */
#define CMP_CS_CMPXSEN                           BIT(2)                         /*!< CMPx scaler enable */
#define CMP_CS_CMPXPL                            BIT(3)                         /*!< polarity of CMPx output */
#define CMP_CS_CMPXINTEN                         BIT(6)                         /*!< CMPx interrupt enable */
#define CMP_CS_CMPXRSTMD                         BIT(7)                         /*!< CMPx reset mode */
#define CMP_CS_CMPXHST                           BITS(8,10)                     /*!< CMPx hysteresis */
#define CMP_CS_CMPXMSEL                          BITS(16,18)                    /*!< CMPx_IM input selection */
#define CMP_CS_CMPXPSEL                          BIT(20)                        /*!< CMPx_IP input selection */
#define CMP_CS_CMPXBLK                           BITS(24,27)                    /*!< CMPx output blanking source */
#define CMP_CS_CMPXLK                            BIT(31)                        /*!< CMPx lock */

/* consts definitions */
/* CMP units */
typedef enum
{
    CMP0 = 0x00U,                                                               /*!< Comparator 0 */
    CMP1,                                                                       /*!< Comparator 1 */
    CMP2,                                                                       /*!< Comparator 2 */
    CMP3,                                                                       /*!< Comparator 3 */
    CMP4,                                                                       /*!< Comparator 4 */
    CMP5,                                                                       /*!< Comparator 5 */
    CMP6,                                                                       /*!< Comparator 6 */
    CMP7,                                                                       /*!< Comparator 7 */
}cmp_enum;

