wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_cmp.h
/* CMP hysteresis */
#define CS_CMPXHST(regval)                       (BITS(8,10) & ((uint32_t)(regval) << 8U))
#define CMP_HYSTERESIS_NO                        CS_CMPXHST(0)                  /*!< CMP output no hysteresis */
#define CMP_HYSTERESIS_10MV                      CS_CMPXHST(1)                  /*!< CMP output 10mv hysteresis */
#define CMP_HYSTERESIS_20MV                      CS_CMPXHST(2)                  /*!< CMP output 20mv hysteresis */
#define CMP_HYSTERESIS_30MV                      CS_CMPXHST(3)                  /*!< CMP output 30mv hysteresis */
#define CMP_HYSTERESIS_40MV                      CS_CMPXHST(4)                  /*!< CMP output 40mv hysteresis */
#define CMP_HYSTERESIS_50MV                      CS_CMPXHST(5)                  /*!< CMP output 50mv hysteresis */
#define CMP_HYSTERESIS_60MV                      CS_CMPXHST(6)                  /*!< CMP output 60mv hysteresis */
#define CMP_HYSTERESIS_70MV                      CS_CMPXHST(7)                  /*!< CMP output 70mv hysteresis */

/* CMP inverting input */
#define CS_CMPXMSEL(regval)                      (BITS(16,18) & ((uint32_t)(regval) << 16U))
#define CMPX_INVERTING_INPUT_1_4VREFINT          CS_CMPXMSEL(0)                /*!< CMP inverting input 1/4 Vrefint */
#define CMPX_INVERTING_INPUT_1_2VREFINT          CS_CMPXMSEL(1)                /*!< CMP inverting input 1/2 Vrefint */
#define CMPX_INVERTING_INPUT_3_4VREFINT          CS_CMPXMSEL(2)                /*!< CMP inverting input 3/4 Vrefint */
#define CMPX_INVERTING_INPUT_VREFINT             CS_CMPXMSEL(3)                /*!< CMP inverting input Vrefint */
#define CMP0_INVERTING_INPUT_DAC2_OUT0           CS_CMPXMSEL(4)                /*!< DAC2_OUT0 input for CMP0 */
#define CMP0_INVERTING_INPUT_DAC0_OUT0           CS_CMPXMSEL(5)                /*!< DAC0_OUT0 input for CMP0 */
#define CMP0_INVERTING_INPUT_PA4                 CS_CMPXMSEL(6)                /*!< PA4 input for CMP0 */
#define CMP0_INVERTING_INPUT_PA0                 CS_CMPXMSEL(7)                /*!< PA0 input for CMP0 */
#define CMP1_INVERTING_INPUT_DAC2_OUT1           CS_CMPXMSEL(4)                /*!< DAC2_OUT1 input for CMP1 */
#define CMP1_INVERTING_INPUT_DAC0_OUT1           CS_CMPXMSEL(5)                /*!< DAC0_OUT1 input for CMP1 */
#define CMP1_INVERTING_INPUT_PA5                 CS_CMPXMSEL(6)                /*!< PA5 input for CMP1 */
#define CMP1_INVERTING_INPUT_PA2                 CS_CMPXMSEL(7)                /*!< PA2 input for CMP1 */
#define CMP2_INVERTING_INPUT_DAC2_OUT0           CS_CMPXMSEL(4)                /*!< DAC2_OUT0 input for CMP2 */
#define CMP2_INVERTING_INPUT_DAC0_OUT0           CS_CMPXMSEL(5)                /*!< DAC0_OUT0 input for CMP2 */
#define CMP2_INVERTING_INPUT_PF1                 CS_CMPXMSEL(6)                /*!< PF1 input for CMP2 */
#define CMP2_INVERTING_INPUT_PC0                 CS_CMPXMSEL(7)                /*!< PC0 input for CMP2 */
#define CMP3_INVERTING_INPUT_DAC2_OUT1           CS_CMPXMSEL(4)                /*!< DAC2_OUT1 input for CMP3 */
#define CMP3_INVERTING_INPUT_DAC0_OUT0           CS_CMPXMSEL(5)                /*!< DAC0_OUT0 input for CMP3 */
#define CMP3_INVERTING_INPUT_PE8                 CS_CMPXMSEL(6)                /*!< PE8 input for CMP3 */
#define CMP3_INVERTING_INPUT_PB2                 CS_CMPXMSEL(7)                /*!< PB2 input for CMP3 */
#define CMP4_INVERTING_INPUT_DAC3_OUT0           CS_CMPXMSEL(4)                /*!< DAC3_OUT0 input for CMP4 */
#define CMP4_INVERTING_INPUT_DAC0_OUT1           CS_CMPXMSEL(5)                /*!< DAC0_OUT1 input for CMP4 */
#define CMP4_INVERTING_INPUT_PB10                CS_CMPXMSEL(6)                /*!< PB10 input for CMP4 */
#define CMP4_INVERTING_INPUT_PD13                CS_CMPXMSEL(7)                /*!< PD13 input for CMP4 */
#define CMP5_INVERTING_INPUT_DAC3_OUT1           CS_CMPXMSEL(4)                /*!< DAC3_OUT1 input for CMP5 */
#define CMP5_INVERTING_INPUT_DAC1_OUT0           CS_CMPXMSEL(5)                /*!< DAC1_OUT0 input for CMP5 */
#define CMP5_INVERTING_INPUT_PD10                CS_CMPXMSEL(6)                /*!< PD10 input for CMP5 */
#define CMP5_INVERTING_INPUT_PB15                CS_CMPXMSEL(7)                /*!< PB15 input for CMP5 */
#define CMP6_INVERTING_INPUT_DAC3_OUT0           CS_CMPXMSEL(4)                /*!< DAC3_OUT0 input for CMP6 */
#define CMP6_INVERTING_INPUT_DAC1_OUT0           CS_CMPXMSEL(5)                /*!< DAC1_OUT0 input for CMP6 */
#define CMP6_INVERTING_INPUT_PD15                CS_CMPXMSEL(6)                /*!< PD15 input for CMP6 */
#define CMP6_INVERTING_INPUT_PB12                CS_CMPXMSEL(7)                /*!< PB12 input for CMP6 */
#define CMP7_INVERTING_INPUT_DAC3_OUT1           CS_CMPXMSEL(4)                /*!< DAC3_OUT1 input for CMP7 */
#define CMP7_INVERTING_INPUT_DAC1_OUT1           CS_CMPXMSEL(5)                /*!< DAC1_OUT1 input for CMP7 */
#define CMP7_INVERTING_INPUT_PD8                 CS_CMPXMSEL(6)                /*!< PD8 input for CMP7 */
#define CMP7_INVERTING_INPUT_PD9                 CS_CMPXMSEL(7)                /*!< PD9 input for CMP7 */

/* CMP noninverting input*/
#define CS_CMPXPSEL(regval)                      (BIT(20) & ((uint32_t)(regval) << 20U))
#define CMP0_NONINVERTING_INPUT_PA1              CS_CMPXPSEL(0)                /*!< CMP noninverting input PA1 for CMP0 */
#define CMP0_NONINVERTING_INPUT_PB1              CS_CMPXPSEL(1)                /*!< CMP noninverting input PB1 for CMP0 */
#define CMP1_NONINVERTING_INPUT_PA7              CS_CMPXPSEL(0)                /*!< CMP noninverting input PA7 for CMP1 */
#define CMP1_NONINVERTING_INPUT_PA3              CS_CMPXPSEL(1)                /*!< CMP noninverting input PA3 for CMP1 */
#define CMP2_NONINVERTING_INPUT_PA0              CS_CMPXPSEL(0)                /*!< CMP noninverting input PA0 for CMP2 */
#define CMP2_NONINVERTING_INPUT_PC1              CS_CMPXPSEL(1)                /*!< CMP noninverting input PC1 for CMP2 */
#define CMP3_NONINVERTING_INPUT_PB0              CS_CMPXPSEL(0)                /*!< CMP noninverting input PB0 for CMP3 */
#define CMP3_NONINVERTING_INPUT_PE7              CS_CMPXPSEL(1)                /*!< CMP noninverting input PE7 for CMP3 */
#define CMP4_NONINVERTING_INPUT_PB13             CS_CMPXPSEL(0)                /*!< CMP noninverting input PB13 for CMP4 */
#define CMP4_NONINVERTING_INPUT_PD12             CS_CMPXPSEL(1)                /*!< CMP noninverting input PD12 for CMP4 */
#define CMP5_NONINVERTING_INPUT_PB11             CS_CMPXPSEL(0)                /*!< CMP noninverting input PB11 for CMP5 */
#define CMP5_NONINVERTING_INPUT_PD11             CS_CMPXPSEL(1)                /*!< CMP noninverting input PD11 for CMP5 */
#define CMP6_NONINVERTING_INPUT_PB14             CS_CMPXPSEL(0)                /*!< CMP noninverting input PB14 for CMP6 */
#define CMP6_NONINVERTING_INPUT_PD14             CS_CMPXPSEL(1)                /*!< CMP noninverting input PD14 for CMP6 */
#define CMP7_NONINVERTING_INPUT_PC2              CS_CMPXPSEL(0)                /*!< CMP noninverting input PC2 for CMP7 */
#define CMP7_NONINVERTING_INPUT_PE9              CS_CMPXPSEL(1)                /*!< CMP noninverting input PE9 for CMP7 */

/* CMP blanking source */
#define CS_CMPXBLK(regval)                       (BITS(24,27) & ((uint32_t)(regval) << 24U))
#define CMPX_BLANKING_NONE                       CS_CMPXBLK(0)                 /*!< CMP no blanking source */
#define CMP0_BLANKING_TIMER0_OC2                 CS_CMPXBLK(1)                 /*!< CMP TIMER0_CH2 output compare signal selected as blanking source for CMP0 */
#define CMP0_BLANKING_TIMER1_OC2                 CS_CMPXBLK(2)                 /*!< CMP TIMER1_CH2 output compare signal selected as blanking source for CMP0 */
#define CMP0_BLANKING_TIMER2_OC2                 CS_CMPXBLK(3)                 /*!< CMP TIMER2_CH2 output compare signal selected as blanking source for CMP0 */
#define CMP0_BLANKING_TIMER7_OC2                 CS_CMPXBLK(4)                 /*!< CMP TIMER7_CH2 output compare signal selected as blanking source for CMP0 */
#define CMP0_BLANKING_TIMER19_OC2                CS_CMPXBLK(5)                 /*!< CMP TIMER19_CH2 output compare signal selected as blanking source for CMP0 */
#define CMP0_BLANKING_TIMER14_OC0                CS_CMPXBLK(6)                 /*!< CMP TIMER14_CH0 output compare signal selected as blanking source for CMP0 */
#define CMP0_BLANKING_TIMER3_OC2                 CS_CMPXBLK(7)                 /*!< CMP TIMER3_CH2 output compare signal selected as blanking source for CMP0 */
#define CMP1_BLANKING_TIMER0_OC2                 CS_CMPXBLK(1)                 /*!< CMP TIMER0_CH2 output compare signal selected as blanking source for CMP1 */
#define CMP1_BLANKING_TIMER1_OC2                 CS_CMPXBLK(2)                 /*!< CMP TIMER1_CH2 output compare signal selected as blanking source for CMP1 */
#define CMP1_BLANKING_TIMER2_OC2                 CS_CMPXBLK(3)                 /*!< CMP TIMER2_CH2 output compare signal selected as blanking source for CMP1 */
#define CMP1_BLANKING_TIMER7_OC2                 CS_CMPXBLK(4)                 /*!< CMP TIMER7_CH2 output compare signal selected as blanking source for CMP1 */
#define CMP1_BLANKING_TIMER19_OC2                CS_CMPXBLK(5)                 /*!< CMP TIMER19_CH2 output compare signal selected as blanking source for CMP1 */
#define CMP1_BLANKING_TIMER14_OC0                CS_CMPXBLK(6)                 /*!< CMP TIMER14_CH0 output compare signal selected as blanking source for CMP1 */
#define CMP1_BLANKING_TIMER3_OC2                 CS_CMPXBLK(7)                 /*!< CMP TIMER3_CH2 output compare signal selected as blanking source for CMP1 */
#define CMP2_BLANKING_TIMER0_OC2                 CS_CMPXBLK(1)                 /*!< CMP TIMER0_CH2 output compare signal selected as blanking source for CMP2 */
#define CMP2_BLANKING_TIMER2_OC2                 CS_CMPXBLK(2)                 /*!< CMP TIMER2_CH2 output compare signal selected as blanking source for CMP2 */
#define CMP2_BLANKING_TIMER1_OC3                 CS_CMPXBLK(3)                 /*!< CMP TIMER1_CH3 output compare signal selected as blanking source for CMP2 */
#define CMP2_BLANKING_TIMER7_OC2                 CS_CMPXBLK(4)                 /*!< CMP TIMER7_CH2 output compare signal selected as blanking source for CMP2 */
#define CMP2_BLANKING_TIMER19_OC2                CS_CMPXBLK(5)                 /*!< CMP TIMER19_CH2 output compare signal selected as blanking source for CMP2 */
#define CMP2_BLANKING_TIMER14_OC0                CS_CMPXBLK(6)                 /*!< CMP TIMER14_CH0 output compare signal selected as blanking source for CMP2 */
#define CMP2_BLANKING_TIMER3_OC2                 CS_CMPXBLK(7)                 /*!< CMP TIMER3_CH2 output compare signal selected as blanking source for CMP2 */
#define CMP3_BLANKING_TIMER2_OC3                 CS_CMPXBLK(1)                 /*!< CMP TIMER2_CH3 output compare signal selected as blanking source for CMP3 */
#define CMP3_BLANKING_TIMER7_OC2                 CS_CMPXBLK(2)                 /*!< CMP TIMER7_CH2 output compare signal selected as blanking source for CMP3 */
#define CMP3_BLANKING_TIMER14_OC1                CS_CMPXBLK(3)                 /*!< CMP TIMER14_CH1 output compare signal selected as blanking source for CMP3 */
#define CMP3_BLANKING_TIMER0_OC2                 CS_CMPXBLK(4)                 /*!< CMP TIMER0_CH2 output compare signal selected as blanking source for CMP3 */
#define CMP3_BLANKING_TIMER19_OC2                CS_CMPXBLK(5)                 /*!< CMP TIMER19_CH2 output compare signal selected as blanking source for CMP3 */
#define CMP3_BLANKING_TIMER14_OC0                CS_CMPXBLK(6)                 /*!< CMP TIMER14_CH0 output compare signal selected as blanking source for CMP3 */
#define CMP3_BLANKING_TIMER3_OC2                 CS_CMPXBLK(7)                 /*!< CMP TIMER3_CH2 output compare signal selected as blanking source for CMP3 */
#define CMP4_BLANKING_TIMER1_OC2                 CS_CMPXBLK(1)                 /*!< CMP TIMER1_CH2 output compare signal selected as blanking source for CMP4 */
#define CMP4_BLANKING_TIMER7_OC2                 CS_CMPXBLK(2)                 /*!< CMP TIMER7_CH2 output compare signal selected as blanking source for CMP4 */
#define CMP4_BLANKING_TIMER2_OC2                 CS_CMPXBLK(3)                 /*!< CMP TIMER2_CH2 output compare signal selected as blanking source for CMP4 */
#define CMP4_BLANKING_TIMER0_OC2                 CS_CMPXBLK(4)                 /*!< CMP TIMER0_CH2 output compare signal selected as blanking source for CMP4 */
#define CMP4_BLANKING_TIMER19_OC2                CS_CMPXBLK(5)                 /*!< CMP TIMER19_CH2 output compare signal selected as blanking source for CMP4 */
#define CMP4_BLANKING_TIMER14_OC0                CS_CMPXBLK(6)                 /*!< CMP TIMER14_CH0 output compare signal selected as blanking source for CMP4 */
#define CMP4_BLANKING_TIMER3_OC2                 CS_CMPXBLK(7)                 /*!< CMP TIMER3_CH2 output compare signal selected as blanking source for CMP4 */
#define CMP5_BLANKING_TIMER7_OC2                 CS_CMPXBLK(1)                 /*!< CMP TIMER7_CH2 output compare signal selected as blanking source for CMP5 */
#define CMP5_BLANKING_TIMER1_OC3                 CS_CMPXBLK(2)                 /*!< CMP TIMER1_CH3 output compare signal selected as blanking source for CMP5 */
#define CMP5_BLANKING_TIMER14_OC1                CS_CMPXBLK(3)                 /*!< CMP TIMER14_CH1 output compare signal selected as blanking source for CMP5 */
#define CMP5_BLANKING_TIMER0_OC2                 CS_CMPXBLK(4)                 /*!< CMP TIMER0_CH2 output compare signal selected as blanking source for CMP5 */
#define CMP5_BLANKING_TIMER19_OC2                CS_CMPXBLK(5)                 /*!< CMP TIMER19_CH2 output compare signal selected as blanking source for CMP5 */
#define CMP5_BLANKING_TIMER14_OC0                CS_CMPXBLK(6)                 /*!< CMP TIMER14_CH0 output compare signal selected as blanking source for CMP5 */
#define CMP5_BLANKING_TIMER3_OC2                 CS_CMPXBLK(7)                 /*!< CMP TIMER3_CH2 output compare signal selected as blanking source for CMP5 */
#define CMP6_BLANKING_TIMER0_OC2                 CS_CMPXBLK(1)                 /*!< CMP TIMER0_CH2 output compare signal selected as blanking source for CMP6 */
#define CMP6_BLANKING_TIMER7_OC2                 CS_CMPXBLK(2)                 /*!< CMP TIMER7_CH2 output compare signal selected as blanking source for CMP6 */
#define CMP6_BLANKING_TIMER2_OC2                 CS_CMPXBLK(3)                 /*!< CMP TIMER2_CH2 output compare signal selected as blanking source for CMP6 */
#define CMP6_BLANKING_TIMER14_OC1                CS_CMPXBLK(4)                 /*!< CMP TIMER14_CH1 output compare signal selected as blanking source for CMP6 */
#define CMP6_BLANKING_TIMER19_OC2                CS_CMPXBLK(5)                 /*!< CMP TIMER19_CH2 output compare signal selected as blanking source for CMP6 */
#define CMP6_BLANKING_TIMER14_OC0                CS_CMPXBLK(6)                 /*!< CMP TIMER14_CH0 output compare signal selected as blanking source for CMP6 */
#define CMP6_BLANKING_TIMER3_OC2                 CS_CMPXBLK(7)                 /*!< CMP TIMER3_CH2 output compare signal selected as blanking source for CMP6 */
#define CMP7_BLANKING_TIMER1_OC2                 CS_CMPXBLK(1)                 /*!< CMP TIMER1_CH2 output compare signal selected as blanking source for CMP7 */
#define CMP7_BLANKING_TIMER7_OC2                 CS_CMPXBLK(2)                 /*!< CMP TIMER7_CH2 output compare signal selected as blanking source for CMP7 */
#define CMP7_BLANKING_TIMER2_OC2                 CS_CMPXBLK(3)                 /*!< CMP TIMER2_CH2 output compare signal selected as blanking source for CMP7 */
#define CMP7_BLANKING_TIMER0_OC2                 CS_CMPXBLK(4)                 /*!< CMP TIMER0_CH2 output compare signal selected as blanking source for CMP7 */
#define CMP7_BLANKING_TIMER19_OC2                CS_CMPXBLK(5)                 /*!< CMP TIMER19_CH2 output compare signal selected as blanking source for CMP7 */
#define CMP7_BLANKING_TIMER14_OC0                CS_CMPXBLK(6)                 /*!< CMP TIMER14_CH0 output compare signal selected as blanking source for CMP7 */
#define CMP7_BLANKING_TIMER3_OC2                 CS_CMPXBLK(7)                 /*!< CMP TIMER3_CH2 output compare signal selected as blanking source for CMP7 */

/* output polarity of comparator */
#define CMP_OUTPUT_POLARITY_INVERTED             ((uint32_t)0x00000001)         /*!< output is inverted */
#define CMP_OUTPUT_POLARITY_NONINVERTED          ((uint32_t)0x00000000)         /*!< output is not inverted */
                                                 
