wujc106/gd32g553r/Firmware/GD32G5x3_standard_peripheral/Include/gd32g5x3_cmp.h
/* comparator output level */
#define CMP_OUTPUTLEVEL_HIGH                     ((uint32_t)0x00000001U)        /*!< comparator output high */
#define CMP_OUTPUTLEVEL_LOW                      ((uint32_t)0x00000000U)        /*!< comparator output low */

/* CMP flags */
#define CMP_FLAG_CMP0F                           CMP_STAT_CMP0IF                /*!< CMP0 interrupt flag */
#define CMP_FLAG_CMP1F                           CMP_STAT_CMP1IF                /*!< CMP1 interrupt flag */
#define CMP_FLAG_CMP2F                           CMP_STAT_CMP2IF                /*!< CMP2 interrupt flag */
#define CMP_FLAG_CMP3F                           CMP_STAT_CMP3IF                /*!< CMP3 interrupt flag */
#define CMP_FLAG_CMP4F                           CMP_STAT_CMP4IF                /*!< CMP4 interrupt flag */
#define CMP_FLAG_CMP5F                           CMP_STAT_CMP5IF                /*!< CMP5 interrupt flag */
#define CMP_FLAG_CMP6F                           CMP_STAT_CMP6IF                /*!< CMP6 interrupt flag */
#define CMP_FLAG_CMP7F                           CMP_STAT_CMP7IF                /*!< CMP7 interrupt flag */

/* CMP flags clear */
#define CMP_FLAG_CMP0F_CLR                       CMP_IFC_CMP0IC                 /*!< CMP0 flag clear */
#define CMP_FLAG_CMP1F_CLR                       CMP_IFC_CMP1IC                 /*!< CMP1 flag clear */
#define CMP_FLAG_CMP2F_CLR                       CMP_IFC_CMP2IC                 /*!< CMP2 flag clear */
#define CMP_FLAG_CMP3F_CLR                       CMP_IFC_CMP3IC                 /*!< CMP3 flag clear */
#define CMP_FLAG_CMP4F_CLR                       CMP_IFC_CMP4IC                 /*!< CMP4 flag clear */
#define CMP_FLAG_CMP5F_CLR                       CMP_IFC_CMP5IC                 /*!< CMP5 flag clear */
#define CMP_FLAG_CMP6F_CLR                       CMP_IFC_CMP6IC                 /*!< CMP6 flag clear */
#define CMP_FLAG_CMP7F_CLR                       CMP_IFC_CMP7IC                 /*!< CMP7 flag clear */

/* CMP interrupt flags */
#define CMP_INT_FLAG_CMP0F                       CMP_STAT_CMP0IF                /*!< CMP0 interrupt flag */
#define CMP_INT_FLAG_CMP1F                       CMP_STAT_CMP1IF                /*!< CMP1 interrupt flag */
#define CMP_INT_FLAG_CMP2F                       CMP_STAT_CMP2IF                /*!< CMP2 interrupt flag */
#define CMP_INT_FLAG_CMP3F                       CMP_STAT_CMP3IF                /*!< CMP3 interrupt flag */
#define CMP_INT_FLAG_CMP4F                       CMP_STAT_CMP4IF                /*!< CMP4 interrupt flag */
#define CMP_INT_FLAG_CMP5F                       CMP_STAT_CMP5IF                /*!< CMP5 interrupt flag */
#define CMP_INT_FLAG_CMP6F                       CMP_STAT_CMP6IF                /*!< CMP6 interrupt flag */
#define CMP_INT_FLAG_CMP7F                       CMP_STAT_CMP7IF                /*!< CMP7 interrupt flag */

/* CMP interrupt flags clear */
#define CMP_INT_FLAG_CMP0F_CLR                   CMP_IFC_CMP0IC                 /*!< CMP0 interrupt flag clear */
#define CMP_INT_FLAG_CMP1F_CLR                   CMP_IFC_CMP1IC                 /*!< CMP1 interrupt flag clear */
#define CMP_INT_FLAG_CMP2F_CLR                   CMP_IFC_CMP2IC                 /*!< CMP2 interrupt flag clear */
#define CMP_INT_FLAG_CMP3F_CLR                   CMP_IFC_CMP3IC                 /*!< CMP3 interrupt flag clear */
#define CMP_INT_FLAG_CMP4F_CLR                   CMP_IFC_CMP4IC                 /*!< CMP4 interrupt flag clear */
#define CMP_INT_FLAG_CMP5F_CLR                   CMP_IFC_CMP5IC                 /*!< CMP5 interrupt flag clear */
#define CMP_INT_FLAG_CMP6F_CLR                   CMP_IFC_CMP6IC                 /*!< CMP6 interrupt flag clear */
#define CMP_INT_FLAG_CMP7F_CLR                   CMP_IFC_CMP7IC                 /*!< CMP7 interrupt flag clear */

/* function declarations */
/* initialization functions */
/* CMP deinit */
void cmp_deinit(void);
/* CMP mode init */
void cmp_mode_init(cmp_enum cmp_periph, uint32_t inverting_input, uint32_t output_hysteresis);
/* CMP noninverting input select */
void cmp_noninverting_input_select(cmp_enum cmp_periph, uint32_t noninverting_input);
/* CMP output init */
void cmp_output_init(cmp_enum cmp_periph, uint32_t output_polarity);
/* CMP output blanking function init */
void cmp_blanking_init(cmp_enum cmp_periph,uint32_t blanking_source_selection);

/* enable functions */
/* enable CMP */
void cmp_enable(cmp_enum cmp_periph);
/* disable CMP */
void cmp_disable(cmp_enum cmp_periph);
/* lock the CMP */
void cmp_lock_enable(cmp_enum cmp_periph);
/* enable the voltage scaler */
void cmp_voltage_scaler_enable(cmp_enum cmp_periph);
/* disable the voltage scaler */
void cmp_voltage_scaler_disable(cmp_enum cmp_periph);
/* enable the scaler bridge */
void cmp_scaler_bridge_enable(cmp_enum cmp_periph);
/* disable the scaler bridge */
void cmp_scaler_bridge_disable(cmp_enum cmp_periph);
/* enable comparator reset persisit mode */
void cmp_reset_persist_mode_enable(cmp_enum cmp_periph);
/* disable comparator reset persisit mode */
void cmp_reset_persist_mode_disable(cmp_enum cmp_periph);

/* get state related functions */
/* get output level */
uint32_t cmp_output_level_get(cmp_enum cmp_periph);

/* flag and interrupt functions */
/* get CMP flag */
FlagStatus cmp_flag_get(uint32_t flag);
/* clear CMP flag */
void cmp_flag_clear(uint32_t flag);
/* enable CMP interrupt */
void cmp_interrupt_enable(cmp_enum cmp_periph);
/* disable CMP interrupt */
void cmp_interrupt_disable(cmp_enum cmp_periph);
/* get CMP interrupt flag */
FlagStatus cmp_interrupt_flag_get(cmp_enum cmp_periph, uint32_t flag);
/* clear CMP interrupt flag */
void cmp_interrupt_flag_clear(uint32_t flag);

#endif /* GD32G5X3_CMP_H */
